# Resync this file from the machine with:  brew bundle dump --file=homebrew/Brewfile --force
# Install / update with:  brew bundle --file=homebrew/Brewfile

# ── Taps ─────────────────────────────────────────────────────────────
tap "anomalyco/tap"
tap "ddosify/tap"
tap "gromgit/fuse"
tap "homebrew/bundle"
tap "oven-sh/bun"

# ── Shell & prompt ───────────────────────────────────────────────────
brew "atuin"                       # fuzzy shell history (Ctrl-R)
brew "fzf"
brew "fzf-tab"
brew "starship"
brew "stow"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-fast-syntax-highlighting"
brew "zsh-syntax-highlighting"

# ── CLI utilities ────────────────────────────────────────────────────
brew "bat"
brew "dust"
brew "hyperfine"
brew "jq"
brew "lsd"
brew "neovim"
brew "pandoc"
brew "pngquant"
brew "ripgrep"
brew "tmux"

# ── Git / forges ─────────────────────────────────────────────────────
brew "gh"
brew "glab"
brew "gitlab-runner"
brew "lazygit"
brew "worktrunk"

# ── Languages & toolchains ───────────────────────────────────────────
brew "fnm"                         # node version manager (this machine)
brew "mise"                        # runtime manager (used on other machines)
brew "pyenv"                       # python version manager (other machines)
brew "sdkman-cli"                  # java/sdk manager (sourced by .zshrc)
brew "go"
brew "rustup"
brew "maven"
brew "gradle"
brew "cocoapods"
brew "yarn"
brew "oven-sh/bun/bun"

# ── Cloud / infra ────────────────────────────────────────────────────
brew "azure-cli"
brew "flyctl"
brew "tailscale", restart_service: :changed

# ── Databases ────────────────────────────────────────────────────────
brew "libpq"
brew "postgresql@14"

# ── Mobile / media ───────────────────────────────────────────────────
brew "fastlane"
brew "scrcpy"
brew "fonttools"
brew "immich-go"
brew "weasyprint"

# ── AI ───────────────────────────────────────────────────────────────
brew "ollama"
brew "gemini-cli"
brew "anomalyco/tap/opencode"

# ── Casks ────────────────────────────────────────────────────────────
cask "amethyst"
cask "android-commandlinetools"
cask "android-platform-tools"
cask "antigravity"
cask "brave-browser"
cask "docker"
cask "gcloud-cli"
cask "google-chrome"
cask "insomnia"
cask "intellij-idea"
cask "karabiner-elements"
cask "obsidian"
cask "orbstack"
cask "qbittorrent"
cask "steam"
cask "vlc"
cask "wezterm"
