# BASE — installed on every machine. Profile extras live in:
#   homebrew/Brewfile.work   homebrew/Brewfile.home
# setup.sh installs base + the active profile (DOTFILES_PROFILE, else hostname).
# Resync a profile:  brew bundle dump --file=homebrew/Brewfile.<profile> --force

# ── Taps ─────────────────────────────────────────────────────────────
tap "anomalyco/tap"

# ── Shell & prompt ───────────────────────────────────────────────────
brew "atuin"                       # fuzzy shell history (Ctrl-R)
brew "fzf"
brew "fzf-tab"
brew "starship"
brew "stow"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "zsh-fast-syntax-highlighting"

# ── CLI utilities ────────────────────────────────────────────────────
brew "bat"
brew "fd"
brew "glow"
brew "jq"
brew "lsd"
brew "neovim"
brew "ripgrep"
brew "tmux"

# ── Git / forges ─────────────────────────────────────────────────────
brew "git"
brew "git-lfs"
brew "gh"
brew "lazygit"
brew "worktrunk"

# ── Runtimes (per-machine version managers, see profile files) ───────
brew "mise"                        # runtimes (node, java, go, python, rust…)

# ── AI ───────────────────────────────────────────────────────────────
brew "anomalyco/tap/opencode"

# ── Casks (common GUI apps) ──────────────────────────────────────────
cask "amethyst"
cask "brave-browser"
cask "google-chrome"
cask "karabiner-elements"
cask "obsidian"
cask "orbstack"                    # provides docker — no Docker Desktop needed
cask "wezterm"
