tap "ddosify/tap"
tap "gromgit/fuse"
tap "homebrew/bundle"
tap "oven-sh/bun"
brew "bat"
brew "cmake"
brew "fnm"
brew "fzf"
brew "git"
brew "go"
brew "hyperfine"
brew "lazygit"
brew "lsd"
brew "neovim"
brew "ollama"
brew "pnpm"
brew "ripgrep"
brew "fd"
brew "stow"
brew "tmux"
brew "tree"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "ddosify/tap/ddosify"
brew "gromgit/fuse/ntfs-3g-mac"
brew "oven-sh/bun/bun"
cask "wezterm"
cask "karabiner-elements"
cask "amethyst"
cask "obsidian"
cask "brave-browser"
cask "google-chrome"
cask "docker"
cask "insomnia"
cask "pgadmin4"
cask "qbittorrent"
cask "vlc"
cask "macfuse"
cask "ntfstool"
